# Many to Many Relationships

Think about a Human Resources database for a large company

* Departments
* Employees
* Titles
* Managers
* Salaries

## Basic LDS

![](company_simple.png)

## Eliminating Many-Many relationship

![](company_intermediate.png)

## From Model to Table

```
employees=# \d departments
          Table "public.departments"
  Column   |         Type          | Modifiers
-----------+-----------------------+-----------
 dept_no   | character(4)          | not null
 dept_name | character varying(40) | not null


employees=# \d dept_emp
       Table "public.dept_emp"
  Column   |     Type     | Modifiers
-----------+--------------+-----------
 emp_no    | integer      | not null
 dept_no   | character(4) | not null
 from_date | date         | not null
 to_date   | date         | not null


employees=# \d employees
            Table "public.employees"
   Column   |         Type          | Modifiers
------------+-----------------------+-----------
 emp_no     | integer               | not null
 birth_date | date                  | not null
 first_name | character varying(14) | not null
 last_name  | character varying(16) | not null
 gender     | character varying(1)  | not null
 hire_date  | date                  | not null

```

## The Final LDS

![](company_advanced.png)

In [1]:
import warnings
warnings.filterwarnings('ignore')

In [2]:
%load_ext sql

In [3]:
%sql postgresql://yasiro01:@localhost/employees

'Connected: yasiro01@employees'

In [4]:
%%sql

select *
from departments natural join dept_emp natural join employees natural join salaries natural join titles
limit 10

10 rows affected.

[(13021, datetime.date(1991, 10, 18), datetime.date(1992, 3, 19), 'd005', 'Development', datetime.date(1957, 3, 10), 'Yurii', 'Schaap', 'M', datetime.date(1991, 10, 18), 45553, 'Senior Engineer'),
 (15083, datetime.date(1996, 5, 30), datetime.date(1997, 4, 19), 'd006', 'Quality Management', datetime.date(1958, 11, 24), 'Denis', 'Nicolson', 'M', datetime.date(1994, 3, 2), 68084, 'Senior Engineer'),
 (17091, datetime.date(1992, 2, 11), datetime.date(1992, 3, 20), 'd004', 'Production', datetime.date(1958, 11, 8), 'Gunilla', 'Merkl', 'F', datetime.date(1988, 1, 30), 48099, 'Assistant Engineer'),
 (19343, datetime.date(1986, 6, 2), datetime.date(1986, 11, 18), 'd007', 'Sales', datetime.date(1953, 10, 12), 'Heping', 'Hempstead', 'F', datetime.date(1986, 6, 2), 44351, 'Staff'),
 (20910, datetime.date(1995, 12, 9), datetime.date(1996, 1, 7), 'd007', 'Sales', datetime.date(1963, 8, 6), 'Chenyi', 'Kavraki', 'M', datetime.date(1993, 8, 14), 76194, 'Senior Staff'),
 (25281, datetime.date(1993, 7, 27), datetime.date(1993, 11, 8), 'd003', 'Human Resources', datetime.date(1956, 11, 10), 'Fumiyo', 'Delgrande', 'F', datetime.date(1991, 6, 7), 47478, 'Staff'),
 (27762, datetime.date(1991, 4, 9), datetime.date(1991, 8, 14), 'd007', 'Sales', datetime.date(1954, 6, 6), 'Boalin', 'Griswold', 'F', datetime.date(1988, 6, 5), 57852, 'Staff'),
 (28155, datetime.date(1995, 10, 9), datetime.date(1996, 8, 22), 'd002', 'Finance', datetime.date(1961, 9, 1), 'Jianwen', 'Marsiglia', 'F', datetime.date(1990, 1, 11), 74637, 'Staff'),
 (31972, datetime.date(1993, 1, 21), datetime.date(1994, 1, 10), 'd005', 'Development', datetime.date(1952, 12, 18), 'Yifei', 'Kawashimo', 'F', datetime.date(1990, 5, 12), 68011, 'Senior Engineer'),
 (32671, datetime.date(1998, 11, 5), datetime.date(1998, 11, 12), 'd003', 'Human Resources', datetime.date(1963, 3, 31), 'Atreye', 'Tetzlaff', 'M', datetime.date(1996, 12, 22), 40000, 'Staff')]

## How many employees currently work in various departments?

In [9]:
%%sql

select * from dept_emp
where to_date > now()
limit 10

10 rows affected.

[(10001, 'd005', datetime.date(1986, 6, 26), datetime.date(9999, 1, 1)),
 (10002, 'd007', datetime.date(1996, 8, 3), datetime.date(9999, 1, 1)),
 (10003, 'd004', datetime.date(1995, 12, 3), datetime.date(9999, 1, 1)),
 (10004, 'd004', datetime.date(1986, 12, 1), datetime.date(9999, 1, 1)),
 (10005, 'd003', datetime.date(1989, 9, 12), datetime.date(9999, 1, 1)),
 (10006, 'd005', datetime.date(1990, 8, 5), datetime.date(9999, 1, 1)),
 (10007, 'd008', datetime.date(1989, 2, 10), datetime.date(9999, 1, 1)),
 (10009, 'd006', datetime.date(1985, 2, 18), datetime.date(9999, 1, 1)),
 (10010, 'd006', datetime.date(2000, 6, 26), datetime.date(9999, 1, 1)),
 (10012, 'd005', datetime.date(1992, 12, 18), datetime.date(9999, 1, 1))]

In [6]:
%%sql

select dept_name, count(*)
from departments natural join dept_emp
where to_date > now()
group by dept_name
order by count;

9 rows affected.

[('Finance', 12437),
 ('Human Resources', 12898),
 ('Quality Management', 14546),
 ('Marketing', 14842),
 ('Research', 15441),
 ('Customer Service', 17569),
 ('Sales', 37701),
 ('Production', 53304),
 ('Development', 61386)]

1. **Note:** the ``now()`` function is just a convenience for manually entereing the current date
2. **Note:** we can use aggregates without a grouby, realizing that said aggregate applies to the whole result

In [11]:
%%sql

select count(*)
from departments natural join dept_emp natural join employees natural join salaries natural join titles

1 rows affected.

[(7535,)]

## Find all managers of the *Marketing* department

In [15]:
%%sql

select *
from departments natural join dept_manager natural join employees
where dept_name = 'Marketing';

2 rows affected.

[(110022, 'd001', 'Marketing', datetime.date(1985, 1, 1), datetime.date(1991, 10, 1), datetime.date(1956, 9, 12), 'Margareta', 'Markovitch', 'M', datetime.date(1985, 1, 1)),
 (110039, 'd001', 'Marketing', datetime.date(1991, 10, 1), datetime.date(9999, 1, 1), datetime.date(1963, 6, 21), 'Vishwani', 'Minakawa', 'M', datetime.date(1986, 4, 12))]

## Find *current* manager of every department

In [18]:
%%sql

select dept_name, first_name, last_name, from_date
from departments natural join dept_manager natural join employees
where to_date > now()
order by dept_name;

9 rows affected.

[('Customer Service', 'Yuchang', 'Weedman', datetime.date(1996, 1, 3)),
 ('Development', 'Leon', 'DasSarma', datetime.date(1992, 4, 25)),
 ('Finance', 'Isamu', 'Legleitner', datetime.date(1989, 12, 17)),
 ('Human Resources', 'Karsten', 'Sigstam', datetime.date(1992, 3, 21)),
 ('Marketing', 'Vishwani', 'Minakawa', datetime.date(1991, 10, 1)),
 ('Production', 'Oscar', 'Ghazalie', datetime.date(1996, 8, 30)),
 ('Quality Management', 'Dung', 'Pesch', datetime.date(1994, 6, 28)),
 ('Research', 'Hilary', 'Kambil', datetime.date(1991, 4, 8)),
 ('Sales', 'Hauke', 'Zhang', datetime.date(1991, 3, 7))]

## Find all titles within the company

In [20]:
%%sql

select distinct title
from titles;

7 rows affected.

[('Technique Leader',),
 ('Senior Engineer',),
 ('Staff',),
 ('Assistant Engineer',),
 ('Engineer',),
 ('Senior Staff',),
 ('Manager',)]

## Question!

Let's start with all the records

In [21]:
%%sql

select *
from departments natural join dept_emp natural join employees natural join salaries
limit 10;

10 rows affected.

[(286829, datetime.date(1994, 3, 14), datetime.date(1995, 1, 11), 'd001', 'Marketing', datetime.date(1954, 11, 10), 'Kazuhisa', 'Vecchio', 'F', datetime.date(1986, 3, 17), 48149),
 (476388, datetime.date(1995, 9, 21), datetime.date(1995, 11, 28), 'd001', 'Marketing', datetime.date(1960, 7, 1), 'Elvis', 'Kroll', 'M', datetime.date(1991, 10, 13), 65007),
 (210440, datetime.date(1996, 9, 18), datetime.date(1996, 11, 10), 'd001', 'Marketing', datetime.date(1964, 7, 11), 'Chandrasekaran', 'Vernadat', 'M', datetime.date(1994, 6, 10), 49760),
 (465625, datetime.date(1996, 10, 4), datetime.date(1997, 7, 7), 'd001', 'Marketing', datetime.date(1961, 10, 2), 'Claudi', 'Piveteau', 'M', datetime.date(1996, 10, 4), 49259),
 (19196, datetime.date(2000, 1, 28), datetime.date(2000, 5, 12), 'd001', 'Marketing', datetime.date(1956, 8, 10), 'Leucio', 'Sury', 'M', datetime.date(1988, 9, 3), 66890),
 (259294, datetime.date(1991, 2, 7), datetime.date(1991, 5, 17), 'd001', 'Marketing', datetime.date(1962, 3, 13), 'Demos', 'Peyn', 'F', datetime.date(1988, 1, 26), 66971),
 (80329, datetime.date(1999, 8, 6), datetime.date(1999, 9, 5), 'd001', 'Marketing', datetime.date(1959, 9, 9), 'Moon', 'Ponthieu', 'F', datetime.date(1988, 11, 7), 40000),
 (268194, datetime.date(1994, 5, 27), datetime.date(1994, 6, 29), 'd001', 'Marketing', datetime.date(1960, 2, 12), 'Gila', 'Aamodt', 'F', datetime.date(1994, 4, 6), 70796),
 (294469, datetime.date(1995, 8, 17), datetime.date(1996, 5, 22), 'd001', 'Marketing', datetime.date(1960, 7, 18), 'Tetsushi', 'Biran', 'M', datetime.date(1987, 6, 21), 68907),
 (12505, datetime.date(1999, 8, 24), datetime.date(2000, 8, 23), 'd001', 'Marketing', datetime.date(1952, 8, 24), 'Barton', 'Goldhammer', 'M', datetime.date(1991, 4, 20), 40423)]

## Let's look closer at *Barton Goldhammer*

In [23]:
%%sql

select *
from departments natural join dept_emp natural join employees
where employees.first_name = 'Barton' and employees.last_name = 'Goldhammer';

2 rows affected.

[(12505, 'd001', 'Marketing', datetime.date(1999, 8, 24), datetime.date(2000, 8, 23), datetime.date(1952, 8, 24), 'Barton', 'Goldhammer', 'M', datetime.date(1991, 4, 20)),
 (12505, 'd007', 'Sales', datetime.date(2000, 8, 23), datetime.date(2002, 2, 18), datetime.date(1952, 8, 24), 'Barton', 'Goldhammer', 'M', datetime.date(1991, 4, 20))]

## Let's find out how *Barton Goldhammer's* salary changed, if at all

In [31]:
%%sql

select *
from departments natural join dept_emp natural join employees natural join salaries
where employees.first_name = 'Barton' and employees.last_name = 'Goldhammer';

1 rows affected.

[(12505, datetime.date(1999, 8, 24), datetime.date(2000, 8, 23), 'd001', 'Marketing', datetime.date(1952, 8, 24), 'Barton', 'Goldhammer', 'M', datetime.date(1991, 4, 20), 40423)]

## Huh?

## A more specific version of JOIN operator

In [33]:
%%sql

select *
from departments natural join dept_emp natural join employees join salaries on employees.emp_no = salaries.emp_no
where employees.first_name = 'Barton' and employees.last_name = 'Goldhammer'
order by salaries.from_date;

6 rows affected.

[(12505, 'd001', 'Marketing', datetime.date(1999, 8, 24), datetime.date(2000, 8, 23), datetime.date(1952, 8, 24), 'Barton', 'Goldhammer', 'M', datetime.date(1991, 4, 20), 12505, 40423, datetime.date(1999, 8, 24), datetime.date(2000, 8, 23)),
 (12505, 'd007', 'Sales', datetime.date(2000, 8, 23), datetime.date(2002, 2, 18), datetime.date(1952, 8, 24), 'Barton', 'Goldhammer', 'M', datetime.date(1991, 4, 20), 12505, 40423, datetime.date(1999, 8, 24), datetime.date(2000, 8, 23)),
 (12505, 'd001', 'Marketing', datetime.date(1999, 8, 24), datetime.date(2000, 8, 23), datetime.date(1952, 8, 24), 'Barton', 'Goldhammer', 'M', datetime.date(1991, 4, 20), 12505, 43758, datetime.date(2000, 8, 23), datetime.date(2001, 8, 23)),
 (12505, 'd007', 'Sales', datetime.date(2000, 8, 23), datetime.date(2002, 2, 18), datetime.date(1952, 8, 24), 'Barton', 'Goldhammer', 'M', datetime.date(1991, 4, 20), 12505, 43758, datetime.date(2000, 8, 23), datetime.date(2001, 8, 23)),
 (12505, 'd001', 'Marketing', datetime.date(1999, 8, 24), datetime.date(2000, 8, 23), datetime.date(1952, 8, 24), 'Barton', 'Goldhammer', 'M', datetime.date(1991, 4, 20), 12505, 43942, datetime.date(2001, 8, 23), datetime.date(2002, 2, 18)),
 (12505, 'd007', 'Sales', datetime.date(2000, 8, 23), datetime.date(2002, 2, 18), datetime.date(1952, 8, 24), 'Barton', 'Goldhammer', 'M', datetime.date(1991, 4, 20), 12505, 43942, datetime.date(2001, 8, 23), datetime.date(2002, 2, 18))]

## What are the min, max, and average salaries per department?

[PostgreSQL: Documentation: 9.5: Data Type Formatting Functions](https://www.postgresql.org/docs/9.5/static/functions-formatting.html)

In [36]:
%%sql

select dept_name, min(salary), to_char(avg(salary), '999,999.99'), max(salary)
from departments natural join dept_emp natural join employees natural join salaries
group by dept_name;

9 rows affected.

[('Customer Service', 40000, '  43,684.35', 91638),
 ('Development', 40000, '  49,085.11', 100285),
 ('Finance', 40000, '  61,479.84', 105985),
 ('Human Resources', 40000, '  43,069.74', 73900),
 ('Marketing', 40000, '  59,373.39', 100242),
 ('Production', 40000, '  49,057.93', 98370),
 ('Quality Management', 40000, '  46,026.20', 79334),
 ('Research', 40000, '  49,130.98', 81790),
 ('Sales', 40000, '  69,663.26', 112513)]

```
select * from
dept_emp natural join salaries
```

```
emp_no  dept_no from to salary
1       2       X    Y  10
```


```
select * from
dept_emp join salaries on dept_emp.emp_no = salaries.emp_no
```



```
emp_no   dept_no  from_1  to_1 from_2 to_2 salary
1        2        X       Y    X      Y    10
1        3        Y       X    X      Y    10
2        1        X       Y    Y      Z    12

```

## Find the salary history for Holgard Pena

In [ ]:
%%sql

## Find the job title history for Holgard Pena

In [ ]:
%%sql

## Current job title counts per department

In [ ]:
%%sql

## Average salary by job title  - based on current salary and current title

In [ ]:
%%sql

## Who has held the most titles?

In [ ]:
%%sql